<template>
  <v-layout
    column
    justify-center
    align-center
  >
  <v-card light="" class="page">
    <h2>О компании</h2>
    <v-row class="about">
      <v-col 
        cols="12"
        lg="5"
        md="5"
        class="text-right"
      >
        <v-img 
          :src="require('~/static/pages/logo-sec.png')"
          height="400px"
          contain
          position="right"
        ></v-img>
      </v-col>
      <v-col 
        cols="12"
        lg="1"
        md="1"
      >
        <v-item-group class="divider">

        </v-item-group>
      </v-col>
      <v-col 
        cols="12"
        lg="5"
        md="5"
        class="text-left"
        align-self="center"
      >
        <p>
          <v-badge class="stronger">National Center for Development</v-badge> - это быстроразвивающая компания, позволяющая эффективно эффективно использовать трудовые ресурсы мигрантов и направлять их в соответствии с их квалификацией в те страны и те организации, где они наилучшим образом смогут применить свои навыки и знания.
          Мы оказываем квалифицированную помощь трудовым мигрантам Республики Казахстан и других стран Центральной Азии, желающим найти работу за рубежом...
        </p>
      </v-col>
    </v-row>
    <v-row justify="center">
      <v-img 
        :src="require('~/static/pages/image.png')"
        max-width="95%"
      ></v-img>
    </v-row>
    <v-img 
      :src="require('~/static/icons/goal.png')"
      max-width="40%"
      contain
      class="mx-auto mb-5"
    ></v-img>
    <v-row justify="center">
      <div class="mss-wrapper mt-5 mb-10">
        <p>Manpower scoring system - это уникальная платформа празработаная нами, которая позволяет централизованно хранить, проводить отбор, оценивать квалификацию кадровых ресурсов для заинтересованных компаний и партнеров как внутри Республики Казахстан, так и за рубежом. Идея такой системы ранее не применялась и не использовалась в Республике Казахстан.</p>
        <p>Согласно нашей задумке, MSS позволяет собирать и систематизировать данные обо всех кандидатах, обращающихся к нам и желающих работать за рубежом. Информация о кандидате содержит сведения, касающиеся образования, владения языками, опыта работы, личных данных, а также некие оценочные данные о заявителе, определяющие его готовность к трудоустройству в другой стране.</p>
        <p>Собранная информация подлежит оценке. Чем больше навыков и знаний у кандидата, чем более богатый опыт работы он имеет, тем более высокий балл он получит в результате проведения скоринга. Также оценке подлежат возрастные и физические критерии, такие как рост или вес. При рассмотрении кандидатов нами также учитывается наличие или отсутствие у заявителя судимости.</p>
        <p>Наша платформа значительно повышает эффективность взаимодействия с работодателями, существенно расширяет возможности поиска новых рабочих мест. Работодатели, имеющие партнерский статус в компании NCD, получают возможность обращаться непосредственно к огромной базе данных соискателей и выбирать подходящих кандидатов по нужным критериям. В результате такого взаимодействия время поиска работы для соискателя сокращается примерно в 10 раз.</p>
      </div>
    </v-row>
    <v-row class="mission mt-10" justify="center" align="center">
      <v-col cols="12" lg="6" md="6">
        <div class="mission-text">
          <h2>Наша миссия</h2>
          <p>
стать самой успешной и этичной компанией по трудоустройству иностранных работников, а также быть мостом для повышения грамотности и развития образования на рынке труда Казахстана, путем применения...</p>
        </div>
      </v-col>
      <v-col cols="12" lg="6" md="6">
        <v-img 
          :src="require('~/static/icons/peace.png')"
          max-width="40%"
          class="mx-auto"
        ></v-img>
      </v-col>
    </v-row>
    <v-row>
      <v-col cols="12" lg="6" md="6">
        <v-img 
          class="mx-auto mt-10"
          :src="require('~/static/icons/win.png')"
          max-width="40%"
        ></v-img>
      </v-col>
      <v-col cols="12" lg="6" md="6">
        <div class="collab-wrapper">
          <h2>Сотрудничество</h2>
          <p>На сегодняшний день наши офисы находятся в городах Ташкент и Алматы. Мы сотрудничаем с работодателями Словакии, Чехии, Японии, Южной Кореи, США, Канады, Германии, Великобритании, России, Казахстана и стран Восточной Европы.
Со временем наша база данных вырастет до больших размеров, и пул ресурсов и знаний станет достаточно большим. Интерес к нашей деятельности уже проявляют многие зарубежные партнеры. Мы же в свою очередь предлагаем абсолютно прозрачное, легальное и надежное сотрудничество всем...</p>
        </div>
      </v-col>
    </v-row>
  </v-card>
  </v-layout>
</template>

<script>
import Logo from '~/components/Logo.vue'
import VuetifyLogo from '~/components/VuetifyLogo.vue'

export default {
  components: {
    Logo,
    VuetifyLogo
  }
}
</script>
